---
kind: property
id: P:Autodesk.Revit.DB.SymbolTypeId.KN
source: html/9229831a-39a9-5deb-02aa-e3513a8cb46e.htm
---
# Autodesk.Revit.DB.SymbolTypeId.KN Property

Symbol kN, indicating unit Kilonewtons.

## Syntax (C#)
```csharp
public static ForgeTypeId KN { get; }
```